In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [4]:
target=df.Survived
inputs=df.drop('Survived',axis='columns')

In [5]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [6]:
inputs=pd.concat([inputs,dummies],axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [7]:
inputs.drop('Sex',axis='columns',inplace=True)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [8]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [9]:
inputs['Age'][:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [10]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())

In [11]:
inputs.Age[:10]

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [14]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(inputs,target,test_size=0.2)

In [15]:
len(x_train)

712

In [16]:
len(x_test)

179

In [17]:
x_train

     Pclass        Age      Fare  female  male
97        1  23.000000   63.3583       0     1
37        3  21.000000    8.0500       0     1
64        1  29.699118   27.7208       0     1
485       3  29.699118   25.4667       1     0
698       1  49.000000  110.8833       0     1
..      ...        ...       ...     ...   ...
876       3  20.000000    9.8458       0     1
388       3  29.699118    7.7292       0     1
361       2  29.000000   27.7208       0     1
829       1  62.000000   80.0000       1     0
261       3   3.000000   31.3875       0     1

[712 rows x 5 columns]

In [18]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [19]:
model.fit(x_train,y_train)

GaussianNB()

In [20]:
model.score(x_test,y_test)

0.776536312849162

In [21]:
x_test

     Pclass        Age      Fare  female  male
591       1  52.000000   78.2667       1     0
763       1  36.000000  120.0000       1     0
396       3  31.000000    7.8542       1     0
825       3  29.699118    6.9500       0     1
150       2  51.000000   12.5250       0     1
..      ...        ...       ...     ...   ...
0         3  22.000000    7.2500       0     1
546       2  19.000000   26.0000       1     0
402       3  21.000000    9.8250       1     0
85        3  33.000000   15.8500       1     0
537       1  30.000000  106.4250       1     0

[179 rows x 5 columns]

In [23]:
y_test[:10]

591    1
763    1
396    0
825    0
150    0
185    0
553    1
312    0
412    1
68     1
Name: Survived, dtype: int64

In [24]:
model.predict(x_test[:10])

array([1, 1, 1, 0, 0, 0, 0, 1, 1, 1], dtype=int64)

In [25]:
model.predict_prob(x_test[:10])

AttributeError: 'GaussianNB' object has no attribute 'predict_prob'